Moddable-OpenSource/moddable/xs/platforms/nrf52/xsHost.c
	static uint8_t gHasMods;
#endif


/*
	Instrumentation
*/

#ifdef mxInstrument

void modInstrumentationSetup(xsMachine *the)
{
	espInitInstrumentation(the);
	modInstrumentMachineBegin(the, espSampleInstrumentation, espInstrumentCount, (char**)espInstrumentNames, (char**)espInstrumentUnits);
}

static int32_t modInstrumentationSystemFreeMemory(void *theIn)
{
	txMachine *the = theIn;
	return (int32_t)nrf52_memory_remaining();
}

#if INSTRUMENT_CPULOAD
static int32_t modInstrumentationCPU0(void *theIn)
{
	int32_t result, total = (gCPUCounts[0] + gCPUCounts[1]);
	if (!total)
		return 0;
	result = (100 * gCPUCounts[0]) / total;
	gCPUCounts[0] = gCPUCounts[1] = 0;
	return result;
}
#endif

void espInitInstrumentation(txMachine *the)
{
#if MODDEF_XS_TEST
	static uint8_t initialized = 0;
	if (initialized)
		return;
	initialized = 1;
#endif

	modInstrumentationInit();
	modInstrumentationSetCallback(SystemFreeMemory, modInstrumentationSystemFreeMemory);

	modInstrumentationSetCallback(SlotHeapSize, (ModInstrumentationGetter)modInstrumentationSlotHeapSize);
	modInstrumentationSetCallback(ChunkHeapSize, (ModInstrumentationGetter)modInstrumentationChunkHeapSize);
	modInstrumentationSetCallback(KeysUsed, (ModInstrumentationGetter)modInstrumentationKeysUsed);
	modInstrumentationSetCallback(GarbageCollectionCount, (ModInstrumentationGetter)modInstrumentationGarbageCollectionCount);
	modInstrumentationSetCallback(ModulesLoaded, (ModInstrumentationGetter)modInstrumentationModulesLoaded);
	modInstrumentationSetCallback(StackRemain, (ModInstrumentationGetter)modInstrumentationStackRemain);

	gInstrumentMutex = xSemaphoreCreateMutex();

#if INSTRUMENT_CPULOAD
	modInstrumentationSetCallback(CPU0, modInstrumentationCPU0);

	nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
	nrf_drv_timer_init(&cpuTimer, &timer_cfg, cpuTimerHandler);
	uint32_t ticks = nrf_drv_timer_us_to_ticks(&cpuTimer, CPUTIMER_US);
	nrf_drv_timer_extended_compare(&cpuTimer, NRF_TIMER_CC_CHANNEL0, ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

	gIdles[0] = xTaskGetIdleTaskHandle();

	nrf_drv_timer_clear(&cpuTimer);
	nrf_drv_timer_enable(&cpuTimer);
#endif
}

extern SemaphoreHandle_t gDebugMutex;
#include "semphr.h"

void espSampleInstrumentation(modTimer timer, void *refcon, int refconSize)
{
	txInteger values[espInstrumentCount];
	int what;
	xsMachine *the = *(xsMachine **)refcon;

	xSemaphoreTake(gInstrumentMutex, portMAX_DELAY);

	for (what = kModInstrumentationPixelsDrawn; what <= (kModInstrumentationSlotHeapSize - 1); what++)
		values[what - kModInstrumentationPixelsDrawn] = modInstrumentationGet_(the, what);

	if (values[kModInstrumentationTurns - kModInstrumentationPixelsDrawn])
		values[kModInstrumentationTurns - kModInstrumentationPixelsDrawn] -= 1;		// ignore the turn that generates instrumentation

	fxSampleInstrumentation(the, espInstrumentCount, values);

	modInstrumentationSet(PixelsDrawn, 0);
	modInstrumentationSet(FramesDrawn, 0);
	modInstrumentationSet(PocoDisplayListUsed, 0);
	modInstrumentationSet(PiuCommandListUsed, 0);
	modInstrumentationSet(NetworkBytesRead, 0);
	modInstrumentationSet(NetworkBytesWritten, 0);
	modInstrumentationSet(Turns, 0);
	modInstrumentMachineReset(the);

	xSemaphoreGive(gInstrumentMutex);
}

#if INSTRUMENT_CPULOAD
static void cpuTimerHandler(nrf_timer_event_t event_type, void* p_context)
{
	switch (event_type) {
		case NRF_TIMER_EVENT_COMPARE0:
			gCPUCounts[0 + (xTaskGetCurrentTaskHandle() == gIdles[0])] += 1;
			gCPUTime += 1250;
			break;
	}
}
#endif
#endif

/*
	messages
*/
#ifndef MODDEF_TASK_QUEUEWAIT
	#ifdef mxDebug
		#define MODDEF_TASK_QUEUEWAIT	(1000)
	#else
		#define MODDEF_TASK_QUEUEWAIT	(portMAX_DELAY)
	#endif
#endif
typedef struct modMessageRecord modMessageRecord;
typedef modMessageRecord *modMessage;

struct modMessageRecord {
	char				*message;
	modMessageDeliver   callback;
	void                *refcon;
	uint16_t            length;
};

int modMessagePostToMachine(xsMachine *the, uint8_t *message, uint16_t messageLength, modMessageDeliver callback, void *refcon)
{
	modMessageRecord msg;

#ifdef mxDebug
	if (0xffff == messageLength) {
		msg.message = NULL;
		msg.callback = callback;
		msg.refcon = refcon;
		msg.length = 0;
		xQueueSendToBack(the->dbgQueue, &msg, portMAX_DELAY);
		return 0;
	}
#endif

	if (message && messageLength) {
		msg.message = c_malloc(messageLength);
		if (!msg.message) return -1;

		c_memmove(msg.message, message, messageLength);
	}
	else
		msg.message = NULL;
	msg.length = messageLength;
	msg.callback = callback;
	msg.refcon = refcon;

	if (pdTRUE == xQueueSendToBack(the->msgQueue, &msg, MODDEF_TASK_QUEUEWAIT))
		return 0;

	if (msg.message)
		c_free(msg.message);

	return -2;
}

int modMessagePostToMachineFromISR(xsMachine *the, modMessageDeliver callback, void *refcon)
{
	modMessageRecord msg;
	portBASE_TYPE ignore;

	msg.message = NULL;
	msg.length = 0;
	msg.callback = callback;
	msg.refcon = refcon;

	xQueueSendToBackFromISR(the->msgQueue, &msg, &ignore);

	return 0;
}

void modMessageService(xsMachine *the, int maxDelayMS)
{
	modMessageRecord msg;

#if !mxDebug
	modWatchDogReset();
	if (maxDelayMS >= NRFX_WDT_CONFIG_RELOAD_VALUE) {
		#if NRFX_WDT_CONFIG_RELOAD_VALUE <= 1000
			maxDelayMS = 500;
		#else
			maxDelayMS = NRFX_WDT_CONFIG_RELOAD_VALUE - 1000;
		#endif
	}
#endif

#ifdef mxDebug
	while (true) {
		QueueSetMemberHandle_t queue = xQueueSelectFromSet(the->queues, ((uint64_t)maxDelayMS << 10) / 1000);
		if (!queue)
			break;

		// xQueueSelectFromSet seems to require emptying the queue before it will generate another notification
		while (true) {
			if (!xQueueReceive(queue, &msg, 0))
				break;

			(msg.callback)(the, msg.refcon, msg.message, msg.length);
			if (msg.message)
				c_free(msg.message);

			maxDelayMS = 0;
		}
	}
#else
	while (xQueueReceive(the->msgQueue, &msg, ((uint64_t)maxDelayMS << 10) / 1000)) {
		(msg.callback)(the, msg.refcon, msg.message, msg.length);
		if (msg.message)
			c_free(msg.message);

		maxDelayMS = 0;
	}
#endif

	modWatchDogReset();
}

#ifndef modTaskGetCurrent
	#error make sure MOD_TASKS and modTaskGetCurrent are defined
#endif

#ifndef MODDEF_TASK_QUEUELENGTH
	#define MODDEF_TASK_QUEUELENGTH	(10)
#endif

static SemaphoreHandle_t gFlashMutex;

void modMachineTaskInit(xsMachine *the)
{
	the->task = (void *)modTaskGetCurrent();
	the->msgQueue = xQueueCreate(MODDEF_TASK_QUEUELENGTH, sizeof(modMessageRecord));
#ifdef mxDebug
	the->dbgQueue = xQueueCreate(4, sizeof(modMessageRecord));

