Moddable-OpenSource/moddable/xs/platforms/nrf52/xsHost.c
	the->queues = xQueueCreateSet(MODDEF_TASK_QUEUELENGTH + 4);
	xQueueAddToSet(the->msgQueue, the->queues);
	xQueueAddToSet(the->dbgQueue, the->queues);
#endif

	if (NULL == gFlashMutex)
		gFlashMutex = xSemaphoreCreateMutex();
}

void modMachineTaskUninit(xsMachine *the)
{
	modMessageRecord msg;

	if (the->msgQueue) {	
		while (xQueueReceive(the->msgQueue, &msg, 0)) {
			if (msg.message)
				c_free(msg.message);
		}

#ifdef mxDebug
		xQueueRemoveFromSet(the->msgQueue, the->queues);
#endif
		vQueueDelete(the->msgQueue);
	}

#ifdef mxDebug
	if (the->dbgQueue) {
		while (xQueueReceive(the->dbgQueue, &msg, 0))
			;
		xQueueRemoveFromSet(the->dbgQueue, the->queues);
		vQueueDelete(the->dbgQueue);
	}
	if (the->queues)
		vQueueDelete(the->queues);
#endif
}

void modMachineTaskWait(xsMachine *the)
{
	ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
}

void modMachineTaskWake(xsMachine *the)
{
	xTaskNotifyGive(the->task);
}

/*
	promises
*/

static void doRunPromiseJobs(void *machine, void *refcon, uint8_t *message, uint16_t messageLength)
{
	fxRunPromiseJobs((txMachine *)machine);
}

void fxQueuePromiseJobs(txMachine* the)
{
	modMessagePostToMachine(the, NULL, 0, doRunPromiseJobs, NULL);
}

/*
	 user installable modules
*/

#if MODDEF_XS_MODS
static txBoolean spiRead(void *src, size_t offset, void *buffer, size_t size)
{
	return modSPIRead(offset + (uintptr_t)src - (uintptr_t)kFlashStart, size, buffer);
}

static txBoolean spiWrite(void *dst, size_t offset, void *buffer, size_t size)
{
	offset += (uintptr_t)dst;

	if ((offset + kFlashSectorSize) > (uintptr_t)kModulesEnd)
		return 0;		// attempted write beyond end of available space

	if (!(offset & (kFlashSectorSize - 1))) {		// if offset is at start of a sector, erase that sector
		if (!modSPIErase(offset - (uintptr_t)kFlashStart, kFlashSectorSize))
			return 0;
	}

	return modSPIWrite(offset - (uintptr_t)kFlashStart, size, buffer);
}

void *modInstallMods(void *preparationIn, uint8_t *status)
{
	txPreparation *preparation = preparationIn;
	void *result = NULL;

	if (fxMapArchive(preparation, (void *)kModulesStart, (void *)kModulesStart, kFlashSectorSize, spiRead, spiWrite))
		result = (void *)kModulesStart;

	if (XS_ATOM_ERROR == c_read32be(4 + kModulesStart)) {
		*status = *(8 + (uint8_t *)kModulesStart);
		modLog("mod failed");
	}
	else
		*status = 0;

	return result;
}

#endif /* MODDEF_XS_MODS */

/*
	flash
 */

#include "nrf_fstorage_sd.h"

NRF_FSTORAGE_DEF(nrf_fstorage_t fstorage) =
{
//    .evt_handler = NULL,		// don't need this?
    .start_addr = 1,
    .end_addr   = 0x100000,
};

uint8_t modSPIFlashInit(void)
{
	if (!fstorage.start_addr)
		return 1;

	fstorage.start_addr = 0;
    if (NRF_SUCCESS != nrf_fstorage_init(&fstorage, &nrf_fstorage_sd, NULL))
		return 0;

	fstorage.start_addr = 1;

	return 1;
}

static void wait_for_flash_ready(void)
{
    while (nrf_fstorage_is_busy(&fstorage))
		sd_app_evt_wait();
}

uint8_t modSPIRead(uint32_t offset, uint32_t size, uint8_t *dst)
{
	uint8_t temp[4] __attribute__ ((aligned (4)));
	uint32_t toAlign;

	xSemaphoreTake(gFlashMutex, portMAX_DELAY);

	if (!modSPIFlashInit()) {
		xSemaphoreGive(gFlashMutex);
		return 0;
	}

	if (offset & 3) {		// long align offset
		if (NRF_SUCCESS != nrf_fstorage_read(&fstorage, offset & ~3, temp, 4)) {
			xSemaphoreGive(gFlashMutex);
			return 0;
		}
		wait_for_flash_ready();

		toAlign = 4 - (offset & 3);
		c_memcpy(dst, temp + 4 - toAlign, (size < toAlign) ? size : toAlign);

		if (size <= toAlign)
			goto done;

		dst += toAlign;
		offset += toAlign;
		size -= toAlign;
	}

	toAlign = size & ~3;
	if (toAlign) {
//@@ need case here for misaligned destination
		size -= toAlign;
		if (NRF_SUCCESS != nrf_fstorage_read(&fstorage, offset, dst, toAlign)) {
			xSemaphoreGive(gFlashMutex);
			return 0;
		}
		wait_for_flash_ready();

		dst += toAlign;
		offset += toAlign;
	}

	if (size) {				// long align tail
		if (NRF_SUCCESS != nrf_fstorage_read(&fstorage, offset, temp, 4)) {
			xSemaphoreGive(gFlashMutex);
			return 0;
		}
		wait_for_flash_ready();

		c_memcpy(dst, temp, size);
	}

done:
	xSemaphoreGive(gFlashMutex);
	return 1;
}

uint8_t modSPIWrite(uint32_t offset, uint32_t size, const uint8_t *src)
{
	uint8_t temp[512] __attribute__ ((aligned (4)));
	uint32_t toAlign;

	xSemaphoreTake(gFlashMutex, portMAX_DELAY);

	if (!modSPIFlashInit()) {
		xSemaphoreGive(gFlashMutex);
		return 0;
	}

	if (offset & 3) {		// long align offset
		toAlign = 4 - (offset & 3);
		c_memset(temp, 0xFF, 4);
		c_memcpy(temp + 4 - toAlign, src, (size < toAlign) ? size : toAlign);
		if (NRF_SUCCESS != nrf_fstorage_write(&fstorage, offset & ~3, temp, 4, NULL)) {
			xSemaphoreGive(gFlashMutex);
			return 0;
		}
		wait_for_flash_ready();

		if (size <= toAlign) {
			xSemaphoreGive(gFlashMutex);
			return 1;
		}

		src += toAlign;
		offset += toAlign;
		size -= toAlign;
	}

	toAlign = size & ~3;
	if (toAlign) {
		size -= toAlign;
		if (3 & (uintptr_t)src) {	// src is not long aligned, copy through stack
			while (toAlign) {
				uint32_t use = (toAlign > sizeof(temp)) ? sizeof(temp) : toAlign;
				c_memcpy(temp, src, use);
				if (NRF_SUCCESS != nrf_fstorage_write(&fstorage, offset, temp, use, NULL)) {
					xSemaphoreGive(gFlashMutex);
					return 0;
				}
				wait_for_flash_ready();

				toAlign -= use;
				src += use;
				offset += use;
			}
		}
		else {
			if (NRF_SUCCESS != nrf_fstorage_write(&fstorage, offset, src, toAlign, NULL)) {
				xSemaphoreGive(gFlashMutex);
				return 0;
			}
			wait_for_flash_ready();

			src += toAlign;
			offset += toAlign;
		}
	}

	if (size) {			// long align tail
		c_memset(temp, 0xFF, 4);
		c_memcpy(temp, src, size);
		if (NRF_SUCCESS != nrf_fstorage_write(&fstorage, offset, temp, 4, NULL)) {
			xSemaphoreGive(gFlashMutex);
			return 0;
		}
		wait_for_flash_ready();
	}

	xSemaphoreGive(gFlashMutex);
	return 1;
}

uint8_t modSPIErase(uint32_t offset, uint32_t size)
{
	xSemaphoreTake(gFlashMutex, portMAX_DELAY);

	if (!modSPIFlashInit()) {
		xSemaphoreGive(gFlashMutex);
		return 0;
	}

